/*************************************
 * 有一数列：2/1,3/2,5/3,8/5,...求出这 *
 * 个数列的前10项之和，保留两位小数。   *
 * （该序列从第二项起，每一项的分子是前 *
 *  一项分子和分母之和                 *
 *                                   *
 *                                   *
 *************************************/
#include <stdio.h>

int main()
{
    float s = 2;
    int i, u = 3, v = 2;
    for(i = 1; i <= 8; i++)
    {
        u = u + v;
        v = v + i;
        s = s + u * 1.00 / v; //注意，运算符的结合是从左至右的
    }
    printf("s = %.2f", s);
    return 0;
}

//s = s + u / v * 1.00    结果为3.00
//s = s + u * 1.00 / v    结果为3.50
//运算符采用从左至右的方式结合；